"""Задача 9. Список списков

Дан вот такой (уже многомерный!) список:

nice_list = [[[1, 2, 3], [4, 5, 6], [7, 8, 9]], [[10, 11, 12], [13, 14, 15], [16, 17, 18]]]
Напишите код, который «раскрывает» все вложенные списки, то есть оставляет только внешний список.
Для решения используйте только list comprehensions.

Ответ: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18]
"""


nice_list = [
    [[1, 2, 3], [4, 5, 6], [7, 8, 9]],
    [[10, 11, 12], [13, 14, 15], [16, 17, 18]],
]


def expand_list(nice_list: list) -> list:
    return [number for list_1 in nice_list for list_2 in list_1 for number in list_2]


def main():
    print(f"Список списков: {nice_list}")
    print(f"Раскрытый список: {expand_list(nice_list)}")


if __name__ == "__main__":
    main()
